#### Terraform Plan Results for `ec2`

<details><summary>Show Plan</summary>

```diff
[command]/home/runner/work/_temp/206c3e33-2e96-4387-8d02-9279f16c8185/terraform-bin plan -no-color -out=tfplan
module.ec2.aws_security_group.instance_sg: Refreshing state... [id=sg-090192e4e41b1c788]
module.ec2.aws_launch_template.this: Refreshing state... [id=lt-089bdf0c2edbaa3bd]
module.ec2.aws_instance.this: Refreshing state... [id=i-0706492e5f54e0e08]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ec2.aws_instance.this has been deleted
  - resource "aws_instance" "this" {
      - id                                   = "i-0706492e5f54e0e08" -> null
        tags                                 = {
            "Name" = "prod-instance"
        }
        # (32 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = (known after apply)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = (known after apply)
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "prod-instance"
        }
      + tags_all                             = {
          + "Name" = "prod-instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + launch_template {
          + id      = "lt-089bdf0c2edbaa3bd"
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ instance_id        = "i-0706492e5f54e0e08" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.ec2.aws_security_group.instance_sg: Refreshing state... [id=sg-090192e4e41b1c788]%0Amodule.ec2.aws_launch_template.this: Refreshing state... [id=lt-089bdf0c2edbaa3bd]%0Amodule.ec2.aws_instance.this: Refreshing state... [id=i-0706492e5f54e0e08]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.ec2.aws_instance.this has been deleted%0A  - resource "aws_instance" "this" {%0A      - id                                   = "i-0706492e5f54e0e08" -> null%0A        tags                                 = {%0A            "Name" = "prod-instance"%0A        }%0A        # (32 unchanged attributes hidden)%0A%0A        # (9 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.ec2.aws_instance.this will be created%0A  + resource "aws_instance" "this" {%0A      + ami                                  = (known after apply)%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = (known after apply)%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = (known after apply)%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = (known after apply)%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "prod-instance"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "prod-instance"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + launch_template {%0A          + id      = "lt-089bdf0c2edbaa3bd"%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ instance_id        = "i-0706492e5f54e0e08" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
```

</details>

* Plan generated at: `2025-02-02T13:16:25.680Z`
* Pushed by: @abhijeetpoonia
* Action: `repository_dispatch`